# StructuralWallUsage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralWallUsageFilter..::..StructuralWallUsage Property
StructuralWallUsageFilter Class See Also
---
The wall structural usage.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralWallUsage StructuralWallUsage { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralWallUsage As StructuralWallUsage
	Get
```

Visual C++
---
```text
public:
property StructuralWallUsage StructuralWallUsage {
	StructuralWallUsage get ();
}
```

# See Also
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace